app/controllers/properties_controller.rb

  def create
    @property = Property.new(property_params)
    if @property.save
---
INSERT INTO "properties" ("property_name", "rent", "address", "age", "remarks", "created_at", "updated_at", "line_name_1", "station_name_1", "walk_fraction_1", "line_name_2", "station_name_2", "walk_fraction_2") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @property = Property.find(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def edit
    @property = Property.find(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def destroy
    @property = Property.find(params[:id])
    @property.destroy
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "properties" WHERE "properties"."id" = ?  [["id", 1]]